app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = 1
SELECT 1 AS one FROM "books" WHERE "books"."user_id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."user_id" = 2 AND (title LIKE '%ressd%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = 2
---
  def index
    @filter_params = params.permit(:title, :author, :genre) #sanitize filter parameters

    @books = current_user.books #start with all books for the current user

    #apply filters
    @books = @books.where("title LIKE ?", "%#{@filter_params[:title]}%") if @filter_params[:title].present?
    @books = @books.where("author LIKE ?", "%#{@filter_params[:author]}%") if @filter_params[:author].present?
    @books = @books.where("genre LIKE ?", "%#{@filter_params[:genre]}%") if @filter_params[:genre].present?

    @books = @books.page(params[:page]).per(5) #paginate the filtered books

INSERT INTO "books" ("title", "author", "genre", "published_on", "created_at", "updated_at", "user_id") VALUES ('ressd', 'sads', 'dsd', '2025-07-18', '2025-07-29 17:15:19.395870', '2025-07-29 17:15:19.395870', 2) RETURNING "id"
---
  def create
    @book = current_user.books.build(book_params) #build new book with params

    if @book.save

UPDATE "books" SET "author" = 'test1a', "updated_at" = '2025-07-28 20:15:28.076628' WHERE "books"."id" = 1
---
  def update
    if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = 5
---
  def destroy
    @book.destroy! #delete the book

SELECT "books".* FROM "books" WHERE "books"."user_id" = 2 AND "books"."id" = 5 LIMIT 1
---
    def set_book
      @book = current_user.books.find(params[:id]) #find user's book by ID